{"S1": "Other well known / well established open source projects are producing SBOMs", "S2": "Other well known / well established open source projects are consuming SBOMs", "S3": "As an open source project, do you publish a list of your project's dependencies?", "S4": "How do your projects obtain the list of dependencies?", "S5": "Why do you projects not publish their dependencies?", "FS1": "Which SBOM formats do your projects use?", "FS2": "The use of SBOMs is critical in software development", "FS3": "Current SBOM standards / specifications meet the needs of users and industry", "FS4": "Which deficiencies have you or your projects encountered in current SBOM standards / specifications?", "FS5": "How can we address the selected deficiencies in SBOM standards / specifications?", "FS6": "Current SBOM tool support meets the needs of users", "FS7": "What are some issues that you or your projects have encountered in SBOM tooling?", "FS8": "How can we address current deficiencies in SBOM tooling?", "FS9": "Do your projects have a process to verify whether SBOMs completely and correctly report all dependencies and their metadata?", "FS10": "What process do your projects have to verify whether SBOMs completely and correctly report all dependencies and their metadata?", "NU1": "What tools and / or techniques do you use for dependency management in your software projects?", "NU2": "Why do you prefer these tools and / or techniques over other methods?", "P1": "Select all statements that apply to your projects", "P2": "At what point in the software development process should SBOMs be generated?", "P3": "Why do your projects create SBOMs?", "P4": "What benefits have your projects observed from producing SBOMs?", "P5": "What tools do your projects use to assist in the creation of SBOMs, if any?", "P6": "Do your projects have any strategies for managing SBOM versions?", "P7": "What strategies do your projects have for managing SBOM versions?", "P8": "What issues have your projects encountered when producing SBOMs?", "IP1": "Do your projects share their SBOMs externally?", "IP2": "Why are your projects' SBOMs not shared externally?", "EP1": "How do your projects publish / distribute your created SBOMs?", "C1": "What do your projects use SBOMs for?", "C2": "Which of the following benefits have your projects observed from using SBOMs?", "C3": "How often do your projects use SBOMs during software development?", "C4": "Do your projects process or analyze the SBOMs of their software dependencies?", "C5": "How do your projects process or analyze the SBOMs of their dependencies?", "C6": "Which issues have your projects encountered in using SBOMs?", "C7": "How do you prefer the SBOMs of other projects be shared with you?", "FN1": "Which of the following SBOM formats have you heard of?", "FN2": "Have you used SBOMs in the past?", "FN3": "Why do you not currently SBOMs?", "O1": "Are you familiar with Operations Bills of Materials?", "O2": "How would you describe OBOMs?  What are their key features?", "O3": "Do you use OBOMs in your projects?", "O4": "What should OBOMs be used for?", "Q1": "How many years of experience in software development do you have?", "Q2": "How would you describe your primary role?", "Q3": "What is your highest level of education?", "Q4": "Which programming languages have you most used in past projects?", "Q5": "What types of systems have you developed?", "Q6": "Do you primarily work on open source or closed source projects?", "Q7": "For which domains have your developed applications?", "Q8": "Do you have a background in computer security?", "Q9": "Do you have a background in software licensing?", "Q10": "How often did you release or help release a new major version over the past two years?", "Q11": "Which countries are you or your organization based in?", "ID": "How are SBOMs used in your projects?"}