{"B1": "Are you familiar with the concept of Software Bill of Materials?", "B2": "Which of the following SBOM formats are you familiar with?", "B3": "Are you aware of any existing SBOM standards / specifications for ML/DL systems (AIBOMs)?", "AI1": "Current SBOM formats adequately support machine/deep learning (ML/DL) systems.", "AI2": "What data fields should be included in SBOMs to adequately describe a machine/deep learning (ML/DL) system?", "AI3": "Can SBOMs of ML/DL systems (AIBOMs) follow the same current SBOM specifications and standards?", "AI4": "Please describe a potential new solution for specifying SBOMs of ML/DL systems (AIBOMS).", "AI5": "Are you aware of any tools which currently facilitate the automatic generation of AIBOMs?", "AI6": "How would you prefer AIBOMs be distributed?", "AI7": "How can we ensure that AIBOMs completely and correctly report all the dependencies of ML/DL systems?", "D1": "Datasets for ML/DL systems should come with a bill of materials", "D2": "Are you aware of any existing standards for DataBOMs?", "D3": "What data fields should be included in a DataBOM to adequately describe a dataset for a ML/DL system?", "D4": "Are you aware of any tools that generate DataBOMs?", "D5": "What do you think the relationship between AIBOMs and DataBOMs should be?", "D6": "How should DataBOMs be shared / distributed?", "D7": "What are some of the benefits you expect to see from using DataBOMs, if any?", "D8": "What main challenges do you foresee in the creation and use of DataBOMs?", "D9": "How can we ensure that DataBOMs completely and correctly report all the dependencies and/or components of datasets used by ML/DL systems?", "C1": "What are some of the benefits you expect to see from using AIBOMs, if any?", "C2": "What main challenges do you foresee in the creation and use of AIBOMs?", "C3": "Do vulnerability databases (such as CVE) exist for ML/DL systems?", "C4": "Vulnerability databases for ML/DL systems meet the security needs of developers and consumers", "C5": "Do vulnerability databases (such as CVE) exist for datasets of ML/DL systems?", "C6": "Vulnerability databases for datasets of ML/DL systems meet the security needs of developers and consumers", "C7": "Given recent concerns regarding scraped public material being included in machine/deep learning datasets, how should AIBOMs address licensed material, if at all?", "Q1": "How many years of experience developing machine/deep learning systems do you have?", "Q2": "How would you describe your primary role?", "Q3": "What is your highest level of education?", "Q4": "Which programming languages have you most used in past projects?", "Q5": "Which machine / deep learning models do you use most frequently?", "Q6": "Do you primarily work on open source or closed source projects?", "Q7": "For which domains have your developed applications?", "Q8": "Do you have a background in computer security?", "Q9": "Do you have a background in software licensing?", "Q10": "How often did you release or help release a new major version over the past two years?"}