{"G1": "What are the challenges that people currently face in the supply chain of cyber-physical systems?", "G2": "What is the role of open-source software in cyber-physical systems?", "SB1": "Are you familiar with the concept of Software Bills of Material (SBOMs)?", "HB1": "Are you familiar with the concept of a Hardware Bill of Materials (HBOM)?", "HB2": "Have you ever used HBOMs in a project?", "HB3": "Which formats have you used for HBOMs?", "L1": "SBOMs are a potential solution to problems that people face in the supply chain of cyber-physical systems", "L2": "SBOMs can be used to effectively manage open-source components in cyber-physical systems", "L3": "Current formats (e.g., SPDX or CycloneDX) convey all the information necessary to create inventories of physical components", "L4": "For a cyber-physical system, the software and hardware manifests (i.e., inventories) should be separated into an SBOM and a HBOM (Hardware Bill of Materials).", "L5": "SBOMs/HBOMs can be effectively used to demonstrate compliance with regulatory requirements and standards in cyber-physical systems.", "L6": "Tool support exists for creating and processing SBOMs/HBOMs for cyber-physical systems.", "O1": "What are the necessary data fields that an SBOM or HBOM must contain to accurately and sufficiently describe software/hardware components in cyber-physical systems?", "O2": "What is the role of SBOMs/HBOMs in ensuring the traceability of components in cyber-physical systems?", "O3": "How can the use of SBOMs/HBOMs impact risk assessment in cyber-physical systems?", "O4": "How should SBOMs/HBOMs for cyber-physical systems be distributed? Rank by preference (by dragging the options).", "O5": "(Optional) Do you have anything else you would like to note regarding SBOMs and HBOMs for cyber-physical systems?", "Q1": "How many years of experience in software / hardware development do you have?", "Q2": "How would you describe your primary role?", "Q3": "What is your highest level of education?", "Q4": "Which programming languages have you most used in past projects?", "Q5": "What types of systems have you developed?", "Q6": "Do you primarily work on open source or closed source projects?", "Q7": "For which domains have your developed applications?", "Q8": "Do you have a background in computer security?", "Q9": "Do you have a background in software licensing?", "Q10": "How often did you release or help release a new major version over the past two years?", "Q11": "Which countries are you or your organization based in?"}