{"D1": "Are you familiar with the concept of Software Bills of Materials (SBOMs)?", "D2": "What do you consider to be the minimum adequate baseline component/dependency information for an SBOM?", "D3": "In your estimation, how many SBOMs meet this minimum standard in practice?", "D4": "Are you aware of any specific requirements that organizations must meet when creating SBOMs for software products that will be used in highly regulated industries, such as healthcare, finance, or defense? If so, please describe those requirements.", "L1": "How do you think that an SBOM that includes information about the software and hardware components of such equipment could facilitate faster and more accurate approvals, if at all?", "L2": "Are you aware of any disputes relating to an organization's creation or use of SBOMs?", "L3": "If an SBOM is inaccurate or incomplete, what legal liability do you see for the entity that produced it?", "L4": "What liability do you see for the creators of tools used to automatically generate SBOMs that are incomplete or inaccurate?", "L5": "In your opinion, to what extent will the provision of an accurate and complete SBOM become a standard provision in software licenses and related contracts?", "L6": "Should the creator of an SBOM be required to provide a certification that the SBOM is correct and complete?  Please elaborate on your response.", "L7": "What steps can organizations take to protect their proprietary information and trade secrets when creating and distributing SBOMs?", "L8": "To what extent are organizations legally obligated to disclose any vulnerabilities or security issues they discover as a result of creating an SBOM to their customers, partners, or the public?", "AI2": "In your opinion, would the use of complete and detailed DataBOMs be sufficient to cover the attribution requirements of open source software licenses?", "AI3": "Do you anticipate DataBOMs being used with other large AI projects, like ChatGPT, that are trained on large corpora from the Internet?", "Q1": "How many years of legal experience do you have?", "Q2": "Which country / countries are you and / or your organization based in?", "Q3": "Please enter your email address. This will be used to contact you if you are identified as the recipient of the Amazon gift card.", "Q4": "Would you be willing to participate in a follow-up interview based on your responses?"}