{"Q2": "How would you describe your primary role?", "Q3": "What is your highest level of education?", "Q4": "Which programming languages have you most used in past projects?", "Q5": "What types of systems have you developed?", "Q6": "Do you primarily work on open source or closed source projects?", "Q8": "Do you have a background in computer security?", "Q9": "Do you have a background in software licensing?", "S2": "Which SBOM formats do you use?", "S4": "The use of SBOMs is critical in software development", "S7": "Current SBOM tool support meets the needs of users", "P2": "At what point in the software development process should SBOMs be generated?", "P3": "Why do you create SBOMs?", "P7": "Does your organization have strategies for managing SBOM versions?", "C2": "What do you use SBOMs for?", "C4": "How often do you use SBOMs during software development?", "C5": "Do you process or analyze the SBOMs of the software dependencies that you use?", "T2": "Which SBOM formats does your tool support?", "T3": "What do you use SBOMs for?", "T4": "Who is your tool primarily designed for?", "T5": "In my industry, developers and other stakeholders are aware of the SBOM tools available to them", "SM2": "Where should standards / specifications regarding SBOM creation and usage originate from?", "E2": "Software stakeholders understand the purposes / capabilities of SBOMs", "E3": "Software stakeholders understand how to use SBOMs", "E4": "Which SBOM formats do you teach about / compile resources for?", "SC1": "Vulnerabilities reported for software dependencies I use are important issues for my organization.", "SC2": "Are you involved with writing, reviewing, or maintaining source code?", "SC3": "I trust security scanners and static analysis tools to find vulnerabilities in my code.", "SC4": "I trust that my dependencies are free from security vulnerabilities.", "SC5": "Do you use a dependency tracking system?", "SC6": "If you use a dependency tracking system, does it allow you to easily determine if your project is impacted by a discovered vulnerability?", "Q1": "How many years of experience in software development do you have?", "S9": "How would you prefer SBOMs be distributed?", "E5": "What types of resources are best to inform people about SBOMs?", "S1": "Briefly describe the concept of SBOMs.  What are they?  What is their purpose?", "S3": "Which data fields do you think should be included in SBOMs?", "S5": "What deficiencies currently exist in SBOM standards / specifications?", "S6": "How can we address current deficiencies in SBOM standards / specifications?", "S8": "How can we address current deficiencies in SBOM tooling?", "S10": "Feel free to explain your preferences about how SBOMs should be distributed", "P4": "Please elaborate on the benefits from creating SBOMs that you identified", "P5": "What tools do you use to assist the creation fo SBOMs, if any?", "P8": "What strategies does your organization have for managing SBOM versions?  Are there any specific tools involved?", "P9": "What issues have you faced when creating SBOMs?", "C3": "Please elaborate on the benefits from consuming SBOMs that you identified", "C6": "How do you process or analyze the SBOMs of your dependencies?  What tools, if any, are involved in the process?", "C7": "What issues have you faced when consuming SBOMs?", "T6": "Which SBOM tools have you developed?", "SM3": "How should SBOM standards / specifications be effectively communicated?", "SC7": "What dependency tracking system do you use, and how does it allow you to determine if your project is impacted by a discovered upstream vulnerability?", "SC8": "How do you evaluate the security vulnerabilities of the dependencies you use?", "SC9": "In the sofrware that you develop, how do you obtain the list of libraries that it uses?", "Q10": "How often did you release or help release a new major version of an application / software over the past two years?"}